# DefinitionBindingMap Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionBindingMap Class
Members See Also
---
A map that contains mappings of parameter definitions to parameter bindings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DefinitionBindingMap : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class DefinitionBindingMap _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class DefinitionBindingMap : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..DefinitionBindingMap Autodesk.Revit.DB..::..BindingMap
# See Also
DefinitionBindingMap Members
Autodesk.Revit.DB Namespace